//Задача1
// let a = prompt ('Чему равна переменная?');
// if (a == 10) {
//     alert ('Верно');
// } else {
//     alert ('Неверно')
// }
// 
// 
// // Задача2
// let min = prompt('напиши число от 0 до 59, а я напишу в какой четверти часа оно находится')
// if (min >= 0 && min <= 14) {
// 	alert('В первую четверть.');
// }
// if (min >= 15 && min <= 30) {
// 	alert('Во вторую четверть.');
// }
// if (min >= 31 && min <= 45) {
// 	alert('В третью четверть.');
// }
// if (min >= 46 && min <= 59) {
// 	alert('В четвертую четверть.');
// }
//
//
//Работа с if-else
//1
// let a = 0;
// if (a == 0) {
//     alert ('верно')
// } else {
//     alert ('неверно');
// }      //проверка 1, 0, -3
//
//2
// let a = -3;
// if (a > 0) {
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }        //проверка 1, 0, -3
//
//3
// let a = -3;
// if (a < 0) {
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }        //проверка 1, 0, -3
//
//4
// let a = 0;
// if (a >= 0){
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }        //проверка 1, 0, -3
//
//5
// let a = -3;
// if (a <= 0){
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }        //проверка 1, 0, -3
//
//6
// let a = 0;
// if (a == 0) {
//     alert ('Неверно')
// } else {
//     alert ('Верно');
// }      //проверка 1, 0, -3
//
//7
// let a = 'test';
// if (a == 'test'){
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }      //проверка 'test', 'тест', 3
//
//8
// let a = '1';
// if (a == '1') {
// alert('Верно');
// } else {
// alert('Неверно');
// };     //проверка '1', 1, 3
//
//
//Работа с &&(и) ||(или)
//1
// let a = 2;
// if (a > 0 && a < 5) {
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// }      //проверка 5, 0, -3, 2
//
//2
// let a = 2;
// if (a == 0 || a == 2){
//     alert(a + 7);
// } else{
//     alert(a / 10);
// }       //проверка  5, 0, -3, 2
//
//3
// let a = 3;
// let b = 5;
// if (a <= 1, b >= 3){
//     alert (a + b);
// } else {
//     alert (a - b);
// }       //проверка 1 и 3, 0 и 6, 3 и 5
//
//4
// let a = 1;
// let b = 15;
// if (a > 2 && a < 11, b >= 6 && b < 14) {
//     alert ('Верно')
// } else {
//     alert ('Неверно')
// }
//
//
//Задачи
//1
// let day = prompt('напиши число от 1 до 31, а я напишу в какой четверти оно находится')
// if (day >= 1 && day <= 11) {
// 	alert('В первую четверть.');
// }
// if (day >= 12 && day <= 21) {
// 	alert('Во вторую четверть.');
// }
// if (day >= 22 && day <= 31) {
// 	alert('В третью четверть.');
// }
//
//2
// let month = prompt('напиши число месяца от 1 до 12, а я напишу какое это время года');
// if (month >= 1 && month <= 3) {
//     alert ('Зима');
// } 
// if (month >= 4 &&  month <= 6) {
//     alert ('Весна');
// } 
// if (month >= 7 && month <= 9) {
//     alert ('Лето');
// } 
// if (month >= 10 && month <= 12) {
//     alert ('Осень');
// }
//
//3
// let str = 'abcde';
// if (str[0] == 'a') {
// alert('да');
// } else {
// alert('нет');
// }
//
//4
// let num = '12345';
// if (num[0] == 1 || num[0] == 2 || num[0] == 3) {
// alert('да');
// } else {
// alert('нет');
// }
//
//5
// let num = '123';
// alert (num[0] + num[1] + num[2]);
// не работать:(
//
